In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
rng = np.random.RandomState(42)

In [10]:
ser = pd.Series(rng.randint(0, 10, 4))

In [11]:
ser

0    8
1    1
2    9
3    8
dtype: int64

In [12]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                columns=['A','B','C','D'])

In [13]:
df

   A  B  C  D
0  9  4  1  3
1  6  7  2  0
2  3  1  7  3

In [14]:
np.exp(ser)

0    2980.957987
1       2.718282
2    8103.083928
3    2980.957987
dtype: float64

In [15]:
np.sin(df * np.pi/4)

          A             B         C         D
0  0.707107  1.224647e-16  0.707107  0.707107
1 -1.000000 -7.071068e-01  1.000000  0.000000
2  0.707107  7.071068e-01 -0.707107  0.707107

In [17]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')

In [18]:
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [19]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [20]:
area.index | population.index

/var/folders/2c/5n1ds71d3v35fmncr8yhbwzm0000gn/T/ipykernel_3021/3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [21]:
area.index.union(population)

Index([19651127, 26448193, 38332521, 'Alaska', 'California', 'Texas'], dtype='object')

In [22]:
A = pd.Series([2,4,6], index=[0,1,2])

In [23]:
B = pd.Series([1,3,5], index=[1,2,3])

In [24]:
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [25]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [26]:
A = pd.DataFrame(rng.randint(0, 20, (2,2)), columns=list('AB'))

In [27]:
A

   A  B
0  1  5
1  9  3

In [29]:
B = pd.DataFrame(rng.randint(0, 10, (3,3)), columns=list('BAC'))

In [31]:
B

   B  A  C
0  5  1  9
1  1  9  3
2  7  6  8

In [30]:
A + B

      A     B   C
0   2.0  10.0 NaN
1  18.0   4.0 NaN
2   NaN   NaN NaN

In [32]:
fill = A.stack().mean()

In [33]:
A.add(B, fill_value=fill)

      A     B     C
0   2.0  10.0  13.5
1  18.0   4.0   7.5
2  10.5  11.5  12.5

### Operations Between DataFrame and Series

In [35]:
A = rng.randint(10, size=(3, 4))

In [36]:
A

array([[7, 4, 1, 4],
       [7, 9, 8, 8],
       [0, 8, 6, 8]])

In [37]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 0,  5,  7,  4],
       [-7,  4,  5,  4]])

In [39]:
df = pd.DataFrame(A, columns=list('QRST'))

In [40]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  0  5  7  4
2 -7  4  5  4

In [41]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  3  0 -3  0
1 -2  0 -1 -1
2 -8  0 -2  0

### select row 0,  and every 2 columns

In [42]:
halfrow = df.iloc[0, ::2]

In [43]:
halfrow

Q    7
S    1
Name: 0, dtype: int64

In [44]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  0.0 NaN  7.0 NaN
2 -7.0 NaN  5.0 NaN